# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
# tap 'stripe/stripe-cli'

# Binaries
# brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
# brew 'httpie'
# brew 'jq' # Used for spatie/visit
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
# brew 'stripe/stripe-cli/stripe'
# brew 'stripe/stripe-mock/stripe-mock'
brew 'svn' # Needed to install fonts

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
# brew 'php'
# brew 'php@8.0'
# brew 'php@7.4'
# brew 'composer'
brew 'imagemagick'
# brew 'meilisearch'
brew 'mysql'
# brew 'nginx'
brew 'node'
# brew 'redis'
brew 'yarn'

# Apps
# mine
cask "dropbox"
cask "firefox"
cask "alfred"
cask "figma"
cask "zoom"
cask "via"
cask "adobe-creative-cloud"
cask "pdf-expert"
cask "choosy"
cask "rectangle-pro"
cask "camo-studio"
cask "iterm2"
cask "google-chrome"
cask "slack"
cask "sourcetree"
cask "spotify"
cask "visual-studio-code"
cask "vlc"
cask "contexts"
cask "handbrake"
cask "microsoft-teams"
cask "principle"
cask "sketch"
cask "tunnelbear"
cask "xld"
cask "plex"
cask "calibre"
cask "default-folder-x"
cask "keka"
cask "transmit"
cask "transmission"
cask "google-drive"
cask "little-snitch"
# install these via app store
# cask "xscope"
# cask "whatsapp"
# cask "fantastical"
# cask "spark"
# cask "todoist"

# from dries
# cask 'caffeine' <- keep mac awake
# cask 'dbngin'
# cask 'docker'
cask 'discord'
cask 'github'
# cask 'helo' <- email tester
cask 'imageoptim'
# cask 'insomnia'
# cask 'pastebot'
# cask 'screenflow'
cask 'zwift'

# Quick Look Plugins (https://github.com/sindresorhus/quick-look-plugins)
cask "qlcolorcode"
cask "qlstephen"
cask "qlmarkdown"
cask "quicklook-json"
cask "qlimagesize"
cask "suspicious-package"
cask "apparency"
cask "quicklookase"
cask "qlvideo"

# Fonts
cask 'font-lato'
cask 'font-jetbrains-mono'
cask 'font-ibm-plex'
cask 'font-open-sans'
cask 'font-roboto'
cask "font-fira-code"
cask "font-ibm-plex"
cask "font-hack"
cask "font-space-mono"
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
